using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//Завдання 1:
//Створіть клас «П'єса», який має зберігати таку інформацію:
// назва п'єси;
// П.І.Б. автора;
// жанр;
// рік.
//Реалізуйте у класі методи та властивості, необхідні для 
//функціонування класу.
//Додайте до класу деструктор. Напишіть код для тестування 
//функціональності класу.
//Напишіть код для деструктора.

//Завдання 3:
//Додайте до першого завдання реалізацію інтерфейсу IDisposable.
//Додайте до другого завдання реалізацію деструктора.
//Напишіть код для тестування нових можливостей.
namespace Task_1
{
    internal class Program
    {
        static void Main(string[] args)
        {

            try
            {
                Piece[] pieces =
            {
            new Piece("Дети Ванюшина", "Сергей Найденов", "драма", 1901),
            new Piece("Стелла Виоланди", "Григориос Ксенопулос", "драма", 1909),
            new Piece("Васса Железнова", "Максим Горький", "драма", 1910),
            new Piece("Имярек", "Гуго фон Гофмансталь", "драма", 1911),
            new Piece("Синяя птица", "Морис Метерлинк", "драма", 1908),
            new Piece("Почта", "Рабиндранат Тагор", "драма", 1912),
            new Piece("Пигмалион", "Джордж Бернард Шоу", "драма", 1912),
            new Piece("Зойкина квартира", "Михаил Булгаков", "драма", 1925)
            };

                foreach (var piece in pieces)
                {
                    Console.WriteLine(piece);
                }
                foreach (var piece in pieces)
                    piece.Dispose();
            }
            catch (Exception e) { Console.WriteLine(e); }

        }
    }
}
